{"id":201,"date":"2022-02-12T15:58:28","date_gmt":"2022-02-12T15:58:28","guid":{"rendered":"http:\/\/localhost:10203\/?page_id=201"},"modified":"2022-03-31T03:05:04","modified_gmt":"2022-03-31T03:05:04","slug":"lawyer-seo","status":"publish","type":"page","link":"https:\/\/www.dangilroy.com\/lawyer-seo\/","title":{"rendered":"Lawyer SEO"},"content":{"rendered":"\n<p>Running a business today means having a presence on the Internet. That means having a website with good information, social media accounts to connect with potential clients, and backlinks to your site from online directories. The same goes for lawyers. To gain a foothold in your sector and to attract the clients you need to thrive, you must have the best lawyer SEO for your website. There are possibly hundreds of competing law firms in any given city. Finding yourself on the top of search engine results can mean the difference between upgrading to a new suite of offices to having to take down your shingle.&nbsp;<\/p>\n\n\n\n<h3>Strategies for Choosing the Right SEO Company for Your Law Firm<\/h3>\n\n\n\n<p>A lot is riding on how visible you are on the Internet and how well you rank in search engine results. You need to make sure that you hire the right SEO company to help you reach your goals and succeed. If you search SEOs yourself, many agencies will undoubtedly promise you the best results possible. Choosing between them and finding a reputable firm can be a difficult task. Here are some strategies to help you find an SEO agency for your law firm that can confidently and comfortably work with you.&nbsp;<\/p>\n\n\n\n<h4>1.  Check Their Work History<\/h4>\n\n\n\n<p>When deciding between search engine ranking services, ask them for client case studies or work they have already done. Every industry is different, and it&#8217;s vital to have an SEO company that has knowledge and experience working on SEO for lawyers. They need to know what search terms potential clients might be using and what type of content will better attract them. These factors will differ depending on the type of business and the target audience. When prospective companies show you their work, make sure that they show you an extensive history. They may be able to point to a site or two that are ranking, but they may have many more that are not ranking and have not adequately helped. A good company with experience will have several examples of how they could assist lawyers in several markets to succeed.&nbsp;<\/p>\n\n\n\n<h4>2.  Knowledge of Search Engine Algorithms<\/h4>\n\n\n\n<p>All search engines use algorithms to determine the order of search outcomes. However, they vary between search engines and are secret. Savvy SEO companies study results to understand what works and what doesn&#8217;t. Google is the biggest and, therefore, the most important to understand. It also changes every once in a while, and whoever you hire should be able to adapt your strategy to take advantage of these changes quickly. The company you choose needs to be diligent in doing the work of not just understanding the algorithms but also being able to keep you on top of any changes.&nbsp;<\/p>\n\n\n\n<h4>3.  Website Building Skills<\/h4>\n\n\n\n<p>You can have the best SEO in the world, but if your website isn&#8217;t doing what you need it to do, your ranking won&#8217;t matter. How your site is built and performs plays a part in how well you rank. For instance, if users visit your site but leave within a few seconds, search engines will take that to mean that your site is not reputable and downgrade you for it. Your law firm website needs to be fast, responsive, easy to use and provide all the information you want them to have. On top of that, you want your website to be able to direct visitors to take actions that lead to hiring you. A good SEO company will get people to your site and design it to gain conversions from the highest percentage of visitors possible. Therefore, the SEO company you choose for your firm should understand conversion rate optimization (CRO) and SEO.&nbsp;<\/p>\n\n\n\n<h4>4.  Adaptable To Your Needs<\/h4>\n\n\n\n<p>It&#8217;s not just that SEO specialists need to understand the industry they work. They must also be able to navigate each law firm&#8217;s differing needs easily. Your firm may target clients and handle cases in one section of the law, and other firms handle other things. Your marketing and SEO specialist must appreciate these differences and develop a unique strategy for your firm&#8217;s specific needs.&nbsp;<\/p>\n\n\n\n<h4>5.  They Should Have A Holistic Approach to Web Marketing<\/h4>\n\n\n\n<p>SEO and internet marketing involve a wide range of skills, knowledge, and experience that a good SEO company will possess. They must be experts in everything, from keyword research to organic SEO to web design and everything in between. The more expertise they have, the better results you will get from them. If you don&#8217;t have the right keywords, potential clients will not find your site, and if your site is poorly-designed, you will lose visitors quickly and possibly not get the best links for boosting SEO. With all of those pieces working in tandem, you can get the results you need and ensure your business ranks as highly as possible.&nbsp;<\/p>\n\n\n\n<h4>6.  Beware Of SEOs Who Guarantee Certain Results<\/h4>\n\n\n\n<p>One of the unethical things that some law firm SEO companies do is promise the world but underdeliver. <em>Do not trust any SEO companies that guarantee specific results. The reason for this is it is essentially impossible to predict certain things when it comes to SEO. <\/em>Yes, by hiring an SEO company, you will undoubtedly see an improvement in how you rank for your keywords. However, a reputable company will not guarantee anything because there are too many variables. One of the most significant variables is what your competitors are doing. If they are ranked ahead of you and use all of your company&#8217;s skills and techniques, it would be impossible to leapfrog them. Proper SEO marketing takes time and effort. It would be best to rank not only for the most simple keyword but also for several more to fully capture what your potential clients are entering into their search bars. You can&#8217;t just have &#8220;law firm, Anytown, USA&#8221; as your search terms. You should have keywords that pertain specifically to the services you provide.&nbsp;<\/p>\n\n\n\n<h3>How to Determine if an SEO Provider is Right For Your Law Firm<\/h3>\n\n\n\n<div class=\"hr-box-left\"><div class=\"hr-box-sm outer\"><\/div><div class=\"hr-box-sm inner\"><\/div><div class=\"hr-box-sm middle\"><\/div><div class=\"hr-box-sm inner\"><\/div><div class=\"hr-box-sm outer\"><\/div><\/div>\n\n\n\n<p>When hiring an SEO company to help you, there are some steps you should take to see if it is a good fit. There are also some steps the SEO company should take, as well.&nbsp;<\/p>\n\n\n\n<h4>1.  Discuss Your Goals<\/h4>\n\n\n\n<p>When meeting with a law firm SEO company, the first step is to discuss your goals and objectives with internet marketing. Outline what you are currently doing and what you wish to do. It might be that the internet marketing company suggests that you need a different type of strategy than SEO, such as paying for search results. Either way, discussing your goals and listening to their possible solutions will help determine if you are a good fit for each other.&nbsp;<\/p>\n\n\n\n<h4>2.  Website Analysis<strong>&nbsp;<\/strong><\/h4>\n\n\n\n<p>The foundation of any internet marketing plan is your website, and potential SEO companies should always provide a detailed analysis of yours to see how well it is working. This analysis means evaluating the domain name, how well the website was built, how user-friendly it is, and how well it contributes to boosting your rankings. It could be that your site is dragging your rankings down because of bad links or poor anchor text. Other factors, such as how fast your site loads and whether it is mobile friendly, will be examined to see what isn&#8217;t working and what can be improved. If your site is penalized by Google because of bad links, it can take a long time to correct, and you may need to change your site completely.&nbsp;<\/p>\n\n\n\n<h4>3.  Evaluate the Competition<\/h4>\n\n\n\n<p>A significant factor in google search rankings is what your competition is doing and how well they are doing it. An SEO company will look at the top pages of search results to get a sense of what is working for your competition compared to your website. They can assess how your site compares and what steps can be taken to make it more competitive in what might be a crowded marketplace.&nbsp;<\/p>\n\n\n\n<h4>4. Form a Strategy<\/h4>\n\n\n\n<p>Together, you can form a strategy to win the race and fully optimize your website for search engine results. The solutions must be input from yourself and be tailor-made for your business. By examining what has worked in the past and what is working with your industry, an expert law firm SEO company can find ways to help you stick out on search rankings and get more conversions than ever before. The strategy might be strictly SEO, but it can also combine SEO and other strategies. It may also involve overhauling your website, or it could involve some minor tweaks. Whatever is needed, a good SEO company will develop a plan that will get you the best return on investment possible.&nbsp;<\/p>\n\n\n\n<h3>SEO FAQs<\/h3>\n\n\n\n<div class=\"hr-box-left\"><div class=\"hr-box-sm outer\"><\/div><div class=\"hr-box-sm inner\"><\/div><div class=\"hr-box-sm middle\"><\/div><div class=\"hr-box-sm inner\"><\/div><div class=\"hr-box-sm outer\"><\/div><\/div>\n\n\n\n<p>Have questions about law firm SEO? Here are some frequently asked questions that may have the answers you are looking searching.<\/p>\n\n\n\n<h4>1. What timeframe should I expect for results?<\/h4>\n\n\n\n<p>SEO for law firms, or any industry, is a process that plays out over time. From strategizing to implementing the changes needed and allowing time for Google and other search engines to recognize those changes, it can take several months. You should start to see your ranking rise within four months. If your market is particularly competitive, you could expect it to take a year or more.&nbsp;<\/p>\n\n\n\n<h4>2. How Much Should I Expect to Pay?<\/h4>\n\n\n\n<p>The cost of law firm SEO will vary depending on several factors. Your location, how much work there is, and what type of law you practice will determine the cost. For instance, personal injury is more competitive than estate planning law, so it will cost more to rank your website.&nbsp;<\/p>\n\n\n\n<h4>3.  Why Is Law Firm SEO More Expensive Than Other Industries?<\/h4>\n\n\n\n<p>SEO for law firms is especially competitive. Law firms operate in every part of the country, and they compete with each other for the same clients. Since they are all looking for an edge, SEO is naturally a big part of everyone&#8217;s strategy. To properly stand out, you and your SEO provider will need to expend more time and energy building better content, keeping on top of trends, and researching the algorithms to ensure that you&#8217;re making the best use of them as possible. SEO is an investment. If you cannot invest in proper SEO strategies, you may be hurting yourself in the long run. Google and other search engines can detect when a site uses underhanded tactics. Buying links and posting low-quality content that was quickly thrown together used to be able to boost your SEO, but now that will actively harm you since the search engines will identify your website as untrustworthy. Your SEO provider should always abide by the guidelines provided by the search engines to provide quality SEO in an ethical and meaningful way. Good SEO will help build trust with not just the search engines but also with your clients. You will have solid content on your site and authoritative links that lead back to you from reputable sources. SEO is an investment, but it&#8217;s an investment that is worth it.&nbsp;<\/p>\n\n\n\n<h4>4.  What If I’ve Tried SEO Before and It Didn’t Work?<\/h4>\n\n\n\n<p>There may be several reasons why your previous SEO experience didn&#8217;t work for you. For one, you may have either gone it alone or used a provider that cut corners and did not properly optimize your site. Hiring a law firm SEO company that has experience and knowledge is very important since they will know the ins and outs of your business and will be able to customize a strategy that will help get you at or near the top. They need to be able to provide you with examples and references that show a history of success. In the past, especially if you tried to do it yourself, you may not have had some of the tools you needed to analyze, research, and experiment with your site properly. If you don&#8217;t know what&#8217;s working and what&#8217;s not, your SEO efforts will fail. By hiring an experienced expert SEO company for law firms, you can be sure that they will have all of the research and knowledge and the ability to adapt on the fly if something is not working.&nbsp;<\/p>\n\n\n\n<h4>5.  Is PPC Better Than SEO?<\/h4>\n\n\n\n<p>Neither one is better than the other, but your situation should dictate which one you should use or how you should combine them. Your SEO provider can help you decide based on how quickly you need results and how competitive the market for your target keywords is. If you need to bring in business very quickly, then a Google Ads campaign may be the way to make sure that your firm is getting in front of eyeballs quickly. It would be best if you understood that SEO takes time. It is more about building a sustainable web presence that will help you well into the future than getting as many clicks as possible immediately. You can effectively use both PPC and SEO, however. You can get visitors to your site in the short term while simultaneously building for the future.&nbsp;<\/p>\n\n\n\n<h3>Wrapping Up<\/h3>\n\n\n\n<div class=\"hr-box-left\"><div class=\"hr-box-sm outer\"><\/div><div class=\"hr-box-sm inner\"><\/div><div class=\"hr-box-sm middle\"><\/div><div class=\"hr-box-sm inner\"><\/div><div class=\"hr-box-sm outer\"><\/div><\/div>\n\n\n\n<p>You can read a few books or scan a few websites and probably adopt some of the basic techniques for SEO that will bring you a bit of success. However, you have another job to do: helping your clients. You can&#8217;t devote enough time in your day to properly develop your SEO strategy and design your site to maximize that strategy. Plus, so much more goes into good SEO than just those basic techniques. <\/p>\n\n\n\n<p>A good law firm SEO agency will not just improve your rankings, but they will always work to find ways to get even better results. Research is a massive part of what an SEO agency can provide. They will test techniques, measure results, and track trends to figure out what is working and what is not. Google makes several changes to its algorithm every single day. You can&#8217;t keep up with those trends, but an SEO agency can. Their tests and experiments will be solely relevant for your business and that of your competitors so that they can improve your website&#8217;s performance regularly. A marketing specialist working for your law firm should have the web tools needed to provide you with the most up-to-date and accurate information on who is visiting your site, what&#8217;s getting them there, and how long they stay.&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-center\">*****<\/p>\n\n\n\n<p>As you can see, an SEO agency for your law firm would be a wise choice in a crowded marketplace that gets more competitive. When researching your options, choose a company that is right for your firm and can get you results.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Running a business today means having a presence on the Internet. That means having a website with good information, social media accounts to connect with&#8230;<\/p>\n","protected":false},"author":1,"featured_media":1569,"parent":0,"menu_order":55,"comment_status":"closed","ping_status":"closed","template":"page-seo.php","meta":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Lawyer SEO | Dan Gilroy Design<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.dangilroy.com\/lawyer-seo\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Lawyer SEO | Dan Gilroy Design\" \/>\n<meta property=\"og:description\" content=\"Running a business today means having a presence on the Internet. That means having a website with good information, social media accounts to connect with...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.dangilroy.com\/lawyer-seo\/\" \/>\n<meta property=\"og:site_name\" content=\"Dan Gilroy Design\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/DanGilroyDesign\/\" \/>\n<meta property=\"article:modified_time\" content=\"2022-03-31T03:05:04+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.dangilroy.com\/wp-content\/uploads\/2022\/03\/law-firm-seo-tips.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1920\" \/>\n\t<meta property=\"og:image:height\" content=\"1080\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@dangilroydesign\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.dangilroy.com\/#organization\",\"name\":\"Dan Gilroy Design\",\"url\":\"https:\/\/www.dangilroy.com\/\",\"sameAs\":[\"https:\/\/www.linkedin.com\/company\/9803785\/admin\/\",\"https:\/\/www.facebook.com\/DanGilroyDesign\/\",\"https:\/\/twitter.com\/dangilroydesign\"],\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.dangilroy.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.dangilroy.com\/wp-content\/uploads\/2022\/03\/Dan-Gilroy-Design-2022.png\",\"contentUrl\":\"https:\/\/www.dangilroy.com\/wp-content\/uploads\/2022\/03\/Dan-Gilroy-Design-2022.png\",\"width\":1600,\"height\":277,\"caption\":\"Dan Gilroy Design\"},\"image\":{\"@id\":\"https:\/\/www.dangilroy.com\/#\/schema\/logo\/image\/\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.dangilroy.com\/#website\",\"url\":\"https:\/\/www.dangilroy.com\/\",\"name\":\"Dan Gilroy Design\",\"description\":\"Law Firm Website Design\",\"publisher\":{\"@id\":\"https:\/\/www.dangilroy.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.dangilroy.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.dangilroy.com\/lawyer-seo\/#primaryimage\",\"url\":\"https:\/\/www.dangilroy.com\/wp-content\/uploads\/2022\/03\/law-firm-seo-tips.jpg\",\"contentUrl\":\"https:\/\/www.dangilroy.com\/wp-content\/uploads\/2022\/03\/law-firm-seo-tips.jpg\",\"width\":1920,\"height\":1080,\"caption\":\"Law Firm SEO Tips\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.dangilroy.com\/lawyer-seo\/#webpage\",\"url\":\"https:\/\/www.dangilroy.com\/lawyer-seo\/\",\"name\":\"Lawyer SEO | Dan Gilroy Design\",\"isPartOf\":{\"@id\":\"https:\/\/www.dangilroy.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.dangilroy.com\/lawyer-seo\/#primaryimage\"},\"datePublished\":\"2022-02-12T15:58:28+00:00\",\"dateModified\":\"2022-03-31T03:05:04+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.dangilroy.com\/lawyer-seo\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.dangilroy.com\/lawyer-seo\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.dangilroy.com\/lawyer-seo\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.dangilroy.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Lawyer SEO\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Lawyer SEO | Dan Gilroy Design","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.dangilroy.com\/lawyer-seo\/","og_locale":"en_US","og_type":"article","og_title":"Lawyer SEO | Dan Gilroy Design","og_description":"Running a business today means having a presence on the Internet. That means having a website with good information, social media accounts to connect with...","og_url":"https:\/\/www.dangilroy.com\/lawyer-seo\/","og_site_name":"Dan Gilroy Design","article_publisher":"https:\/\/www.facebook.com\/DanGilroyDesign\/","article_modified_time":"2022-03-31T03:05:04+00:00","og_image":[{"width":1920,"height":1080,"url":"https:\/\/www.dangilroy.com\/wp-content\/uploads\/2022\/03\/law-firm-seo-tips.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@dangilroydesign","twitter_misc":{"Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/www.dangilroy.com\/#organization","name":"Dan Gilroy Design","url":"https:\/\/www.dangilroy.com\/","sameAs":["https:\/\/www.linkedin.com\/company\/9803785\/admin\/","https:\/\/www.facebook.com\/DanGilroyDesign\/","https:\/\/twitter.com\/dangilroydesign"],"logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.dangilroy.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.dangilroy.com\/wp-content\/uploads\/2022\/03\/Dan-Gilroy-Design-2022.png","contentUrl":"https:\/\/www.dangilroy.com\/wp-content\/uploads\/2022\/03\/Dan-Gilroy-Design-2022.png","width":1600,"height":277,"caption":"Dan Gilroy Design"},"image":{"@id":"https:\/\/www.dangilroy.com\/#\/schema\/logo\/image\/"}},{"@type":"WebSite","@id":"https:\/\/www.dangilroy.com\/#website","url":"https:\/\/www.dangilroy.com\/","name":"Dan Gilroy Design","description":"Law Firm Website Design","publisher":{"@id":"https:\/\/www.dangilroy.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.dangilroy.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.dangilroy.com\/lawyer-seo\/#primaryimage","url":"https:\/\/www.dangilroy.com\/wp-content\/uploads\/2022\/03\/law-firm-seo-tips.jpg","contentUrl":"https:\/\/www.dangilroy.com\/wp-content\/uploads\/2022\/03\/law-firm-seo-tips.jpg","width":1920,"height":1080,"caption":"Law Firm SEO Tips"},{"@type":"WebPage","@id":"https:\/\/www.dangilroy.com\/lawyer-seo\/#webpage","url":"https:\/\/www.dangilroy.com\/lawyer-seo\/","name":"Lawyer SEO | Dan Gilroy Design","isPartOf":{"@id":"https:\/\/www.dangilroy.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.dangilroy.com\/lawyer-seo\/#primaryimage"},"datePublished":"2022-02-12T15:58:28+00:00","dateModified":"2022-03-31T03:05:04+00:00","breadcrumb":{"@id":"https:\/\/www.dangilroy.com\/lawyer-seo\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.dangilroy.com\/lawyer-seo\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.dangilroy.com\/lawyer-seo\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.dangilroy.com\/"},{"@type":"ListItem","position":2,"name":"Lawyer SEO"}]}]}},"_links":{"self":[{"href":"https:\/\/www.dangilroy.com\/wp-json\/wp\/v2\/pages\/201"}],"collection":[{"href":"https:\/\/www.dangilroy.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.dangilroy.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.dangilroy.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.dangilroy.com\/wp-json\/wp\/v2\/comments?post=201"}],"version-history":[{"count":10,"href":"https:\/\/www.dangilroy.com\/wp-json\/wp\/v2\/pages\/201\/revisions"}],"predecessor-version":[{"id":1621,"href":"https:\/\/www.dangilroy.com\/wp-json\/wp\/v2\/pages\/201\/revisions\/1621"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.dangilroy.com\/wp-json\/wp\/v2\/media\/1569"}],"wp:attachment":[{"href":"https:\/\/www.dangilroy.com\/wp-json\/wp\/v2\/media?parent=201"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}